# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")


# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")


# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)


# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
bananas = apples * 4


# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4


# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""


# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples = 4
pears = apples + 5
plums = apples - 2
all_trees = apples + pears + plums
print(f"У саду посадили {apples} яблуні. "
      f"Груш на 5 більше яблунь, а слив - на 2 менше."
      f"Скільки всього дерев посадили в саду?"
      f"Відповідь - всього посадили {all_trees} дерев в саду."
)


# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
temp_before_dinner = 0 + 5
temp_after_dinner = temp_before_dinner - 10
temp_evening = temp_after_dinner + 4
print(f"До обіда температура повітря була на {temp_before_dinner} градусів вище нуля.\n"
      f"Після обіду температура опустилася на 10 градусів.\n"
      f"Надвечір потепліло на 4 градуси. Яка температура надвечір?\n"
      f"Відповідь - температура надвечір складає {temp_evening} градуси.")


# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
boys_present = boys - 1
girls = boys // 2
girls_present = girls - 2
print(f"Взагалі у театральному гуртку - {boys} хлопчики, а дівчаток - вдвічі менше.\n"
      f"1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.\n"
      f"Скількі сьогодні дітей у театральному гуртку?\n"
      f"Відповідь - сьогодні у театральному гуртку {boys_present + girls_present} дітей.")


# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
price_book_1 = 8
price_book_2 = price_book_1 + 2
price_book_3 = (price_book_1 + price_book_2) / 2
total_price = price_book_1 + price_book_2 + price_book_3
print(f"Перша книжка коштує {price_book_1} грн., друга - на 2 грн. дороже,\n"
      f"а третя - як половина вартості першої та другої разом.\n"
      f"Скільки будуть коштувати усі книги, якщо купити по одному примірнику?\n"
      f"Відповідь - якщо купити по одному примірнику, то усі книги будуть коштувати {total_price} грн.")