alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n'
                       '"That depends a good deal on where you want to get to," said the Cat.\n'
                       '"I don\'t much care where ——" said Alice.\n'
                       '"Then it doesn\'t matter which way you go," said the Cat.\n'
                       '"—— so long as I get somewhere," Alice added as an explanation.\n'
                       '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."')
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
result = ''
count = 0
for i in alice_in_wonderland:
    if i == "\'":
        result += i
        count += 1
print(result)
print(f"Загальна кількість символів одинарних лапок (') у тексті: {count}")


# task 03 == Виведіть змінну alice_in_wonderland на друк
print(alice_in_wonderland)


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""


# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_sq = 436402
azov_sea_sq = 37800
total_sq = azov_sea_sq + black_sea_sq

print(f'Площа Чорного моря становить {black_sea_sq} км2, а площа Азовського моря становить {azov_sea_sq} км2.\n '
      f'Яку площу займають Чорне та Азовське моря разом?\n '
      f'Площа Чорного та Азовського моря складає {total_sq} км2.')


# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
number_stores = 3
total_store_goods = 375291
goods_store_1_2 = 250449
goods_store_2_3 = 222950
goods_store_1 = total_store_goods - goods_store_2_3
goods_store_3 = total_store_goods - goods_store_1_2
goods_store_2 = total_store_goods - (goods_store_1 + goods_store_3)

print(f'Мережа супермаркетів має {number_stores} склади, де всього розміщено {total_store_goods} товар.\n'
      f'На першому та другому складах перебуває {goods_store_1_2} товарів.\n'
      f'На другому та третьому – {goods_store_2_3} товарів.\n'
      f'Знайдіть кількість товарів, що розміщені на кожному складі.\n'
      f'На кожному складі наступна кількість товарів: \n'
      f' - перший склад: {goods_store_1}\n'
      f' - другий склад: {goods_store_2}\n'
      f' - третій склад: {goods_store_3}\n')


# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
month_sum = 1179
total_period = 18
computer_price = month_sum * total_period

print(f'Михайло разом з батьками вирішили купити комп’ютер, скориставшись послугою «Оплата частинами».\n'
      f'Відомо, що сплачувати необхідно буде півтора року по {month_sum} грн/місяць.\n'
      f'Обчисліть вартість комп’ютера.\n'
      f'Вартість комп\'ютера складає {computer_price} грн.')


# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a_divide = 8019 % 8
b_divide = 9907 % 9
c_divide = 2789 % 5
d_divide = 7248 % 6
e_divide = 7128 % 5
f_divide = 19224 % 9

print(f'''Знайди остачу від діленя чисел:
a) 8019 : 8 = {a_divide}     d) 7248 : 6 = {d_divide}
b) 9907 : 9 = {b_divide}     e) 7128 : 5 = {e_divide}
c) 2789 : 5 = {c_divide}     f) 19224 : 9 = {f_divide}''')


# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
large_pizza_costs = 4 * 274
middle_pizza_costs = 2 * 218
juice_costs = 4 * 35
cake_costs= 1 * 350
water_costs = 3 * 21
total_costs = large_pizza_costs + middle_pizza_costs + juice_costs + cake_costs + water_costs

print(f'''Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн

{total_costs} грн знадобиться для даного її замовлення.''')


# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_foto = 232
foto_per_page = 8
need_pages = total_foto // foto_per_page

print(f'Ігор займається фотографією. Він вирішив зібрати всі свої {total_foto} фотографії\n'
      f'та вклеїти в альбом. На одній сторінці може бути розміщено щонайбільше {foto_per_page} фото.\n'
      f'Скільки сторінок знадобиться Ігорю, щоб вклеїти всі фото?\n'
      f'Ігорю знадобиться {need_pages} сторінок.')


# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance = 1600
tank_capacity = 48
petrol_per_km = 9 / 100
petrol_total = int(petrol_per_km * distance)
refills_number = petrol_total // tank_capacity

print(f'''Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить {distance} км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить {tank_capacity} літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?

Відповіді:
1). {petrol_total} літрів бензину знадобиться для такої подорожі.
2). Щонайменше {refills_number} рази родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак.''')